app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" ORDER BY "todos"."id" ASC
---
  def index
    @todo = Todo.new
    # also order the todo's
    @todos = Todo.order(:id)

INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "sss"], ["created_at", 2016-10-20 09:40:32 UTC], ["updated_at", 2016-10-20 09:40:32 UTC]]
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save